app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 20]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def index
    @comments = Item.find(params[:item_id]).comments

INSERT INTO "comments" ("content", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "klkfjjklsdf"], ["item_id", 28], ["created_at", "2019-01-23 22:09:52.687969"], ["updated_at", "2019-01-23 22:09:52.687969"]]
---
  def create
    @comment = Comment.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "test"], ["updated_at", "2019-02-11 20:09:13.492966"], ["id", 20]]
---
  def update
    @comment= Comment.find(params[:id])
    @comment.content = params[:content]
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 20]]
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 18]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def destroy
    @comment= Comment.find(params[:id])
    @comment.destroy
    @comments = Item.find(params[:item_id]).comments