app/controllers/api/v1/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @item = Item.find(item_params[:id])